//Даны три целых числа. Вывести на экран те, которые кратны числу N<>0.
//Если таких чисел нет, то вывести сообщение «числа не кратны N».

#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL,"rus");

    cout<<"Введите первое число: ";
    int A,B,C;
    cin>>A;
    cout<<"Введите второе число: ";
    cin>>B;
    cout<<"Введите третье число: ";
    cin>>C;

    cout<<endl<<endl<<"Введите число, на которое будет производиться деление: ";
    int N;
    cin>>N;

    cout<<endl;

    A%N!=0 and B%N!=0 and C%N!=0? cout<<"Числа не кратны "<<N<<endl:cout<<"";

    A%N==0? cout<<"Число "<<A<<" кратно числу "<<N<<"."<<endl:cout<<"";
    B%N==0? cout<<"Число "<<B<<" кратно числу "<<N<<"."<<endl:cout<<"";
    C%N==0? cout<<"Число "<<C<<" кратно числу "<<N<<"."<<endl:cout<<"";

}
