//Даны три вещественных числа. Вывести на экран те из них, которые принадлежат интервалу (-6,7;11,2).
//Если таких чисел нет, то вывести сообщение «ТАКИХ ЧИСЕЛ НЕТ»


#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL,"RUS");

    float a,b,c;

    cout<<"Введите число: ";
    cin>>a;
    cout<<"Введите число: ";
    cin>>b;
    cout<<"Введите число: ";
    cin>>c;

    a<=-6.7 or a>=11.2 and b<=-6.6 or b>=11.3 or c<=-6.6 and c>=11.3? cout<<"ТАКИХ ЧИСЕЛ НЕТ"<<endl:cout<<"";

    a>=-6.7 and a<=11.2? cout<<"Число "<<a<<" пренадлежит интервалу."<<endl:cout<<"";
    b>=-6.7 and b<=11.2? cout<<"Число "<<b<<" пренадлежит интервалу."<<endl:cout<<"";
    c>=-6.7 and c<=11.2? cout<<"Число "<<c<<" пренадлежит интервалу."<<endl:cout<<"";
}
