//Напишите программу, которая на отрезке от а до b,
//выводит на экран все числа, оканчивающиеся на цифру три .( а и b –целые числа)

#include <iostream>

using namespace std;

main()
{
    setlocale(LC_ALL,"rus");
    cout<<"Добро пожаловать!\n";
    int a=0,b=0;
    do
    {
        cout<<"\nВведите начало вашего отрезка(а): ";
        while (!(cin>>a))//Вводим значение и если это не цифра, начинается цикл (! - not)
        {
            cout<<"Ошибка, вы ввели что-то не то. ";
            cin.clear();//Очищает поток
            cin.sync();//Удаляет данные из буффера
            cout<<"\nВведите значение для (a): ";
        }
        cout<<"\nВведите конец вашего отрезка(b): ";
        while (!(cin>>b))//Вводим значение и если это не цифра, начинается цикл (! - not)
        {
            cout<<"\nОшибка, вы ввели что-то не то. ";
            cin.clear();//Очищает поток
            cin.sync();//Удаляет данные из буффера
            cout<<"\nВведите значение для (b): ";
        }
        if (a>b) cout<<"\n\nЗначение (a) больше значения (b). Давайте всё заново.";
        if (a==b) cout<<"\n\nВаши значения одинаковы. Давайте всё заново.";
    }
    while (a>b or a==b);//Если первая точка отрезка больше второй или они одинаковы, то пользователя попросят ввести всё заново.

    cout<<"\na = "<<a<<" ; b = "<<b;
    cout<<"\n\nВсе данные верны. Теперь выберем каким способом мы решим задачу.";
    cout<<"\n\nИх три. (while; do...while; for)";
st1: //В случае, если пользователь введёт несуществующий вариант его вернёт через goto (который находится в defautl(swithc)) к этому шагу.
    cout<<"\n\nНажмите 1, чтобы выбрать while";
    cout<<"\nНажмите 2, чтобы выбрать do...while";
    cout<<"\nНажмите 3, чтобы выбрать for";
    cout<<"\n\nВы выбираете: ";

    int vib;//переменная, для выбора способа решения (1,2,3)
    int x=0,S=0;//S - счётчик, в случае если отрезок не содержит чисел с окончанием 3;
                //x - через данную переменную будем проводить вычисления

    while (!(cin>>vib))//Вводим значение и если это не цифра, начинается цикл (! - not)
    {
        cout<<"Ошибка, вы ввели что-то не то. ";
        cin.clear();//Очищает поток
        cin.sync();//Удаляет данные из буффера
        cout<<"Введите цифру: ";
    }

    switch (vib)//оператор switch для выбора одного из трёх путей решений или default для возвращения к st1
    {
    case 1:
    {
        while (a<=b)
        {
            x=a%10;//Остаток от деления числа (а)
            if (x==3)//проверка, является ли последее число тройкой
            {
                ++S;//счётчик, в случае отсутвия чисел с окончание на 3
                cout<<"\nВ данном числе 3 в конце: "<<a;
            }
            a++;//Увеличиваем значение (а) на 1
        }
        cout<<"\n\n";
        if (S==0) cout<<"\n\nНа вашем отрезки не было цифр с 3 в конце\n\n";
        break;//Не позволит продолжить программу, если пользователь выбрал этот способ решения
    }
    case 2:
    {
        do
        {
            x=a%10;//Остаток от деления числа (а)
            if (x==3)//проверка, является ли последее число тройкой
            {
                ++S;//счётчик, в случае отсутвия чисел с окончание на 3
                cout<<"\nВ данном числе 3 в конце: "<<a;
            };
            a++;

        }
        while (a<=b);
        cout<<"\n\n";
        if (S==0) cout<<"\n\nНа вашем отрезки не было цифр с 3 в конце\n\n";
        break;//Не позволит продолжить программу, если пользователь выбрал этот способ решения
    }
    case 3:
    {
        for (; a<=b; ++a)
        {
            x=a%10;//Остаток от деления числа (а)
            if (x==3)//проверка, является ли последее число тройкой
            {
                S++;//счётчик, в случае отсутвия чисел с окончание на 3
                cout<<"\nВ данном числе 3 в конце: "<<a;
            }
        }
        cout<<"\n\n";
        if (S==0) cout<<"\n\nНа вашем отрезки не было цифр с 3 в конце\n\n";
        break;//Не позволит продолжить программу, если пользователь выбрал этот способ решения
    }
    default:
        cout<<"\n\nТакого варинта нет. Давай заново.";
        goto st1;//Если пользователь ввёл несуществуюший вариант, goto вернёт его к st1

    }
}


