//Дан символ. Определить, является ли он цифрой.

#include <iostream>

using namespace std;

main()
{
    setlocale (LC_ALL,"RUS");
    int ch;
    cout<<"Добро пожаловать!\n";
    cout<<"\nВведите символ: ";
    cin>>ch;
    isdigit(ch);//проверяем, является ли введённый пользователем символ - цифрой
    ch? cout<<"\nВаш символ является цифрой.\n\n":cout<<"\nВаш символ не является цифрой.\n\n";

}
