//Определить, какие из трех целых различных чисел принадлежат полуинтервалу (-5;5].

#include <iostream>

using namespace std;

main()
{
    setlocale(LC_ALL,"Russian");
    cout<<"Ваш интервал (-5;5]"<<endl;
    cout<<"Введите 3 числа, чтобы узнать, принадлежат они интервалу или нет."<<endl;
    cout<<"Ваш первое число: ";
    int x1,x2,x3;
    cin>>x1;
    cout<<"Ваше второе число: ";
    cin>>x2;
    cout<<"Ваше третье число: ";
    cin>>x3;


    if (x1>-5 and x1<=5) cout<<"Ваше число "<<x1<<" принадлежит интервалу."<<endl;
    else cout<<"Ваше число "<<x1<<" не принадлежит интервалу"<<endl;
    if (x2>-5 and x2<=5) cout<<"Ваше число "<<x2<<" принадлежит интервалу."<<endl;
    else cout<<"Ваше число "<<x2<<" не принадлежит интервалу"<<endl;
    if (x3>-5 and x3<=5) cout<<"Ваше число "<<x3<<" принадлежит интервалу."<<endl;
    else cout<<"Ваше число "<<x3<<" не принадлежит интервалу"<<endl;
}
