//Дана сумма денег
//Даны купюры номиналом: 1 5 10 20 50 100 200 500 1000
//Собрать данную сумму самым минимальным количеством купюр

#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL,"RUS");

    int A[9];
    int Sum;

    cout<<"Купюры номиналом: 1, 5, 10, 20, 50, 100, 200, 500, 1000"<<endl;
    cout<<"Введите сумму денег: ";
    cin>>Sum;

    cout<<"Минимальное количество купюр, чтобы набрать "<<Sum<<" лей."<<endl<<endl;

    for(int i=0;i<9;i++)
    {
        A[i]=0;
    }

    while(Sum>=1000)
    {
        Sum-=1000;
        A[8]++;
    }

    while(Sum>=500)
    {
        Sum-=500;
        A[7]++;
    }

    while(Sum>=200)
    {
        Sum-=200;
        A[6]++;
    }

    while(Sum>=100)
    {
        Sum-=100;
        A[5]++;
    }

    while(Sum>=50)
    {
        Sum-=50;
        A[4]++;
    }

    while(Sum>=20)
    {
        Sum-=10;
        A[3]++;
    }

    while(Sum>=10)
    {
        Sum-=10;
        A[2]++;
    }

    while(Sum>=5)
    {
        Sum-=5;
        A[1]++;
    }

    while(Sum>=1)
    {
        Sum--;
        A[0]++;
    }

    cout<<"Купюры номиналом 1000 лей: "<<A[8]<<endl;
    cout<<"Купюры номиналом 500 лей: "<<A[7]<<endl;
    cout<<"Купюры номиналом 200 лей: "<<A[6]<<endl;
    cout<<"Купюры номиналом 100 лей: "<<A[5]<<endl;
    cout<<"Купюры номиналом 50 лей: "<<A[4]<<endl;
    cout<<"Купюры номиналом 20 лей: "<<A[3]<<endl;
    cout<<"Купюры номиналом 10 лей: "<<A[2]<<endl;
    cout<<"Купюры номиналом 5 лей: "<<A[1]<<endl;
    cout<<"Купюры номиналом 1 лей: "<<A[0]<<endl;
}
