//Найти произведение и частное двух обыкновенных дробей, для которых известны числители и знаменатели.

#include <iostream>

using namespace std;

main()
{
    setlocale(LC_ALL,"Rus");

    int a,b,c,d;
    int x,y;
    int z,t;

    cout<<"Введите первый числитель: ";
    cin>>a;
    cout<<"Введите первый знаменатель: ";
    cin>>b;
    cout<<"Введите второй числитель: ";
    cin>>c;
    cout<<"Введите второй знаменатель: ";
    cin>>d;

    cout<<"\nПервая дробь: "<<a<<"/"<<b<<endl;
    cout<<"Вторая дробь: "<<c<<"/"<<d<<endl<<endl;



    x=a*c;
    y=b*d;
    cout<<"Сумма ваших дробей: "<<x<<"/"<<y<<endl;

    z=a*d;
    t=b*c;
    cout<<"Разность ваших дробей: "<<z<<"/"<<t<<endl;
}

