//Найти сумму и разность двух обыкновенных дробей, для которых известны числители и знаменатели.

#include <iostream>

using namespace std;

main()
{
    setlocale(LC_ALL,"Rus");

    int a,b,c,d;
    int x,y;
    int z,t;

    cout<<"Введите первый числитель: ";
    cin>>a;
    cout<<"Введите первый знаменатель: ";
    cin>>b;
    cout<<"Введите второй числитель: ";
    cin>>c;
    cout<<"Введите второй знаменатель: ";
    cin>>d;

    cout<<"\nПервая дробь: "<<a<<"/"<<b<<endl;
    cout<<"Вторая дробь: "<<c<<"/"<<d<<endl<<endl;

    if (b==d)
    {
        x=a+c;
        y=d;
        cout<<"Сумма ваших дробей: "<<x<<"/"<<y<<endl;

        z=a-c;
        t=d;
        cout<<"Разность ваших дробей: "<<z<<"/"<<t<<endl;
    }

    else {

        y=d*b;
        x=(a*d)+(c*b);
        cout<<"Сумма ваших дробей: "<<x<<"/"<<y<<endl;

        t=d*b;
        z=(a*d)-(c*b);
        cout<<"Разность ваших дробей: "<<z<<"/"<<t<<endl;
    }




}
