//Дано четырехзначное число. Верно ли, что сумма двух первых его цифр равна сумме двух последних его цифр?

//Дано четырехзначное число. Определить, какая цифра данного числа больше: вторая или третья?

//Дано четырехзначное число. Определить будет ли кратна сумма его цифр двум и пяти.

//Дано четырехзначное число. Определить есть ли у него одинаковые числа.

//Дано четырехзначное число. Верно ли, что среди его цифр есть четные числа.

//Дано четырехзначное число. Верно ли, что среди его цифр есть кратные трем.

//Дано четырехзначное число. Определить, будет ли сумма его цифр трехзначным числом.

//Дано четырехзначное число. Определить будет ли произведение его цифр нечетным числом, кратным трем.

//Дано четырехзначное число. Определить, входит ли в него цифра 6.

#include <iostream>

using namespace std;

main()
{
    setlocale(LC_ALL,"RUS");

    cout<<"Введите число четырёхзначное: ";
    int n;
    cin>>n;

    cout<<endl<<endl;

    int n1,n2,n3,n4;

    n1=n/1000;
    n2=n/100%10;
    n3=n/10%10;
    n4=n%10;

    cout<<"Сумма двух первых его цифр равна сумме двух последних его цифр: "<<boolalpha<<((n1+n2)==(n3+n4))<<endl<<endl;
    cout<<"Вторая цифра больше третей: "<<boolalpha<<(n2>n3)<<endl<<endl;
    cout<<"Сумма цифр вашего четырёхзначного числа кратна 2 и 5: "<<boolalpha<<((n1+n2+n3+n4)%2==0 and (n1+n2+n3+n4)%5==0)<<endl<<endl;
    cout<<"В вашем числе есть одинаковые цифры: "<<boolalpha<<(n1==n2 or n1==n3 or n1==n4 or n2==n3 or n2==n4 or n3==n4)<<endl<<endl;
    cout<<"Среди цифр вашего числа есть чётные: "<<boolalpha<<(n1%2==0 or n2%2==0 or n3%2==0 or n4%2==0)<<endl<<endl;
    cout<<"Среди цифр вашего числа есть кратные трём: "<<boolalpha<<(n1%3==0 or n2%3==0 or n3%3==0 or n4%3==0)<<endl<<endl;
    cout<<"Сумма цифр будет трёхзначным числом: "<<boolalpha<<((n1+n2+n3+n4)>10 and (n1+n2+n3+n4)<100)<<endl<<endl;
    cout<<"Произведение цифр числа нечётно и кратно трём: "<<boolalpha<<((n1*n2*n3)%3==0 and (n1*n2*n3)%2!=0)<<endl<<endl;
    cout<<"Входит ли цифра шесть в это число: "<<boolalpha<<(n1==6 or n2==6 or n3==6 or n4==6)<<endl<<endl;

}
