//Дано трехзначное число. Определить является ли сумма его цифр двухзначным и четным числом.

//Дано трехзначное число. Определить, входит ли в него цифры 3 и 4.

//Дано трехзначное число. Определить, заканчивается ли оно четной цифрой.

//Дано трехзначное число. Верно ли, что оно заканчивается цифрой 5?

//Дано четырехзначное число. Определить, кратна ли трем сумма его цифр.

//Дано трехзначное число. Кратно ли четырем произведение его цифр.

//Дано трехзначное число. Верно ли, что все его цифры одинаковые?

//Дано трехзначное число. Верно ли, что сумма первой и последней его цифр больше, чем сумма второй и третьей его цифр.

//Дано трехзначное число. Определить, является ли сумма его цифр двухзначным числом.

//Дано трехзначное число. Определить, является ли сумма его цифр кратна 3 и 5.

//Дано трехзначное число. Определить, будет ли сумма его цифр больше 15.

//Дано трехзначное число. Определить, равен ли квадрат этого числа сумме кубов его цифр.

//Дано трехзначное число. Определить, что больше: удвоенная сумма его цифр или произведение его цифр.

//Дано трехзначное число. Определить, является ли произведение его цифр трехзначным числом.

//Дано трехзначное число. Верно ли, что все его цифры разные?

#include <iostream>

using namespace std;

main()
{
    setlocale(LC_ALL,"Rus");

    cout<<"Введите трёхзначное число: ";
    int n;
    cin>>n;

    int n1,n2,n3;

    n1=n/100;
    n2=n/10%10;
    n3=n%10;

    cout<<endl<<endl;

    cout<<"Сумма цифр вашего трёхзначного числа двухзначна и чётная: "<<boolalpha<<(n1+n2+n3>10 and n1+n2+n3<100 and (n1+n2+n3)%2==0)<<endl<<endl;
    cout<<"В ваше число входят цифры 3 и 4: "<<boolalpha<<((n1==3 or n2==3 or n3==3) and (n1==4 or n2==4 or n==4))<<endl<<endl;
    cout<<"Последняя цифра вашего числа чётная: "<<boolalpha<<(n3%2==0)<<endl<<endl;
    cout<<"Последняя цифра вашего числа 5: "<<boolalpha<<(n3==5)<<endl<<endl;
    cout<<"Сумма цифр вашего трёхзначного числа кратна 3: "<<boolalpha<<((n1+n2+n3)%3==0)<<endl<<endl;
    cout<<"Произведение цифр вашего трёхзначного числа кратна 4: "<<boolalpha<<((n1*n2*n3)%4==0)<<endl<<endl;
    cout<<"Цифры вашего числа одинаковы: "<<boolalpha<<(n1==n2 and n1==n3 and n2==n3)<<endl<<endl;
    cout<<"Сумма первой и последней цифры больше чем сумма второй и третей: "<<boolalpha<<((n1+n3)>(n2+n3))<<endl<<endl;
    cout<<"Сумма цифр вашего трёхзначного числа двухзначна: "<<boolalpha<<(n1+n2+n3>10 and n1+n2+n3<100)<<endl<<endl;
    cout<<"Сумма цифр вашего трёхзначного числа кратна 3 и 5: "<<boolalpha<<((n1+n2+n3)%3==0 and (n1+n2+n3)%5==0)<<endl<<endl;
    cout<<"Сумма цифр вашего трёхзначного числа больше 15: "<<boolalpha<<(n1+n2+n3>15)<<endl<<endl;
    cout<<"Квадрат трёхзначного числа равен сумме кубов его цифр: "<<boolalpha<<((n*n)==(n1*n1*n1+n2*n2*n2+n3*n3*n3))<<endl<<endl;
    cout<<"Удвоенная сумма цифр трёхзначного числа больше суммы их произведения: "<<boolalpha<<(2*(n1+n2+n3)>n1*n2*n3)<<endl<<endl;
    cout<<"Произведение цифр вашего трёхзначного числа трёхзначна: "<<boolalpha<<((n1*n2*n3)>99 and (n1*n2*n3)<1000)<<endl<<endl;
    cout<<"Все цифры числа разные: "<<boolalpha<<(n1!=n2 and n1!=n3 and n2!=n3)<<endl<<endl;

}
