//Напишите программу, которая в последовательности целых чисел выводит на экран
//минимальное положительное число и произведение отрицательных чисел чисел. Программа получает на вход целые числа,
//количество введенных чисел неизвестно, последовательность чисел заканчивается числом ноль (ноль – признак окончания ввода,
//не входит в последовательность).Количество чисел не превышает 1000. Введенные числа по модулю не превышают 30000.

#include <iostream>
#include <cmath>

using namespace std;

main()
{
    setlocale (LC_ALL,"Russian");
    int x=1,S=0,v,x1=INT_MAX;//int_max, чтобы найти самое минимальное число
    cout<<"Выберете способ решения."<<endl;
    cout<<"1 - while"<<endl;
    cout<<"2 - do..while"<<endl;
    cout<<"3 - for"<<endl;
    cout<<"Вы выбираете: ";
    cin>>v;//ввод варианта решения

    cout<<"Помните, чтобы остановить ввод просто напишите 0"<<endl;

    switch (v)
    {
    case 1:
    {
        while (x!=0)
        {
            cout<<"Введите число:";
            cin>>x;
            if(x<x1 and x>0 and abs(x)<=30000) (x1=x);//установление самого минимального числа
            if (x<=-1 and abs(x)<=30000) S++;//счётчик отрицательных чисел
            if (S==1000) (x=0);
        }
        cout<<"Количество отрицательных чисел, введённых вами: "<<S<<endl;
        cout<<"Минимальное положительное число введённое вами: "<<x1<<endl;
        break;
    }

    case 2:
    {
        do
        {
            cout<<"Введите число: ";
            cin>>x;
            if (x<x1 and x>0 and abs(x)<=30000) (x1=x); //установление самого минимального числа
            if (x<=-1 and abs(x)<=30000) S++;//счётчик отрицательных чисел
            if (S==1000) (x=0);//если будет введено более 1000 цифр, цикл закончится
        }
        while (x!=0);
        cout<<"Количество отрицательных чисел, введённых вами: "<<S<<endl;
        cout<<"Минимальное положительное число введённое вами: "<<x1<<endl;
        break;
    }

    case 3:
    {
        for (;x!=0; )
        {
            cout<<"Введите число: ";
            cin>>x;
                if (x<x1 and x>0) (x1=x);//установление самого минимального числа
                if (x<=-1 and abs(x)<=30000) S++;//счётчик отрицательных чисел
                if (S==1000) (x=0);  //если будет введено более 1000 цифр, цикл закончится
            }
            cout<<"Количество отрицательных чисел, введённых вами: "<<S<<endl;
            cout<<"Минимальное положительное число введённое вами: "<<x1<<endl;
            break;
        }


    default:
        cout<<"Ошибка!";



}
}
