//Дана строка символов S, представляющая собой арифметическое выражение с одним знаком операции (+,-,* или /).
//Напишите программу, которая вычислит значение выражения. Например, для S = ‘234+153’, получим  387.

#include <iostream>
#include <cstring>
#include <stdio.h>
#include <cstdlib>

using namespace std;

main()
{
    setlocale (LC_ALL,"Russian");

    cout<<"Введите пример (число +-*/ число): ";

    char S[255];//Объявление массива символов для ввода пользователя
    gets(S);//Получаем ввод пользователя

    char arf[20]="+-*/";//Массив, для поиска арифметической операции

    char S2[255];//Массив символов, для хранения значений исходного массива
    char S3[255];//Массив, для последнего цикла

    strcpy(S2,S);//Копируем первый массив во второй
    strcpy(S3,S);//Копируем первый массив в третий

    char *first=strtok(S,arf);//Получаем числа до арифметической операции
    char *pov1=strrev(S2);//Переворачивае наш пример (при использовании второго массива)
    char *second=strtok(pov1,arf);//Получаем числа после арифметической операции
    char *pov2=strrev(second);//Переворачиваем значения, чтобы они были в нужном порядке

    int n=atoi(first);//Превращаем первые числа в int
    int n1=atoi(second);//Превращаем числа после арифметической операции в int

    cout<<"Ответ на ваш пример: ";

        for(int i=0; i<strlen(S3); i++) //Цикл для поиска арифметической операции и решения примера
    {
        if (S3[i]=='+') cout<<n<<" "<<S3[i]<<" "<<n1<<" = "<<n+n1;
        if (S3[i]=='-') cout<<n<<" "<<S3[i]<<" "<<n1<<" = "<<n-n1;
        if (S3[i]=='/') cout<<n<<" "<<S3[i]<<" "<<n1<<" = "<<n/n1;
        if (S3[i]=='*') cout<<n<<" "<<S3[i]<<" "<<n1<<" = "<<n*n1;
    }

    cout<<endl<<endl;

}

