//Напишите программу, которая в последовательности целых чисел выводит на экран максимальное число, кратное пяти и тринадцати.
//Программа получает на вход целые числа, количество введенных чисел неизвестно, последовательность чисел заканчивается числом ноль
//(ноль – признак окончания ввода, не входит в последовательность). Количество чисел не превышает 1000.
//Введенные числа по модулю не превышают 30000.

#include <iostream>

using namespace std;

main()
{
    setlocale (0,"Russian");
    cout<<"x: ";
    int x;
    cin>>x;
    cout<<"y: ";
    int y;
    cin>>y;

    if (x<10000 or y<10000)
    {
        while (x<=y)
        {
            if (x%5==0) cout<<x<<endl;
            x++;
        }
    }
    else cout<<"Вы ввели числа больше 10000";




}
