//Напишите программу, которая в последовательности целых чисел определяет сумму всех чисел, кратных 4 и оканчивающихся на 6.
//Программа получает на вход целые числа, количество введенных чисел неизвестно, последовательность чисел заканчивается числом ноль
//(ноль – признак окончания ввода, не входит в последовательность).
//Количество чисел не превышает 1000. Введенные числа по модулю не превышают 30000.
#include <iostream>

using namespace std;

main()
{
    setlocale (LC_ALL,"Russian");
    int n=1,p,S=0,k=0;
    do
    {
        cin>>n;
        p=n%10;//процент от деления
        if (n%4==0 and p==6) S+=n;//если подходит под условие, прибавляется
        k++;

    }
    while (n!=0 and n<30000 and k<1000);
    cout<<S;
}
