//Дано трехзначное число.
//Определить, является ли сумма его цифр двухзначным числом.

#include <iostream>
using namespace std;
main()
{
    setlocale(LC_ALL,"Russian");
    cout<<"Пропишите число из 3 цифр: ";
    int q,w,e,r, S=0;
    cin>>q;
    r=q%10;// третья цифра
    w=q/10%10;// вторая цифра
    e=q/100; // первая цифра
    S=e+w+r; // сумма цифр числа
    S>9 and S<100? cout<<"Двухзначно":cout<<"Недвухзначно";
}
