//Даны три вещественных числа. Вывести на экран те из них, которые принадлежат отрезку [-2,3;6,8]

#include <iostream>

using namespace std;

main()
{
    setlocale(LC_ALL,"RUS");

    float a,b,c;
    cout<<"Введите число a: ";
    cin>>a;
    cout<<"Введите число b: ";
    cin>>b;
    cout<<"Введите число c: ";
    cin>>c;

    a<=6.9 and a>=-2.3? cout<<"Число "<<a<<" принадлежит отрезку."<<endl:cout<<"Число "<<a<<" не пренадлежит отрезку"<<endl;
    b<=6.9 and b>=-2.3? cout<<"Число "<<b<<" принадлежит отрезку."<<endl:cout<<"Число "<<b<<" не пренадлежит отрезку"<<endl;
    c<=6.9 and c>=-2.3? cout<<"Число "<<c<<" принадлежит отрезку."<<endl:cout<<"Число "<<c<<" не пренадлежит отрезку"<<endl;
}
