//Данн массив содержащий N(1<=N<=1000) вещественных элементов.
//Напишите программу, которая создаёт из одного массива 2 массива следующим образом: один из положительных элементов
//Другой из отрицательных элементов исходного массива

#include <iostream>
#include <cmath>
using namespace std;
main()
{
    setlocale (0,"");
    cout<<"Введите количество цифр: ";
    int i, x[1000],y[1000],z[1000],n,k=0,k1=0;
    cin>>n;
    if (n<0) n=abs(n);
    for (i=0; i<n; i++)
    {
        cout<<"Введите число: ";
        cin>>x[i];
    }
    for (int i=0;i<n;i++)
    {
        if (x[i]>0) {y[k++]=x[i];}
        if (x[i]<0) {z[k1++]=x[i];}
        else z[i]=0;
    }
    for (int i=0;i<k;i++)
    {
        cout<<y[i]<<endl;
    }
    cout<<"\n\n";
     for (int i=0;i<k1;i++)
    {
        cout<<z[i]<<endl;
    }

}
