//Дано три целых числа.
//Напишите программу, которая выведет на экран все возможные суммы двух чисел.
//Пример: дано 2 3 4.
//Ответ: 2+13=15 2+4=6 13+4=17

#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL,"RUS");

    int a,b,c;//2 13 4

    cout<<"Введите первое число: ";
    cin>>a;
    cout<<"Введите второе число: ";
    cin>>b;
    cout<<"Введите третье число: ";
    cin>>c;

    cout<<a<<"+"<<b<<"="<<a+b<<endl;
    cout<<a<<"+"<<c<<"="<<a+c<<endl;
    cout<<b<<"+"<<c<<"="<<b+c<<endl;
}
