//Даны три вещественных числа. Вывести на экран те из них, которые являются положительными.
//Если таких чисел нет, то вывести сообщение «ПОЛОЖТЕЛЬНЫХ ЧИСЕЛ НЕТ».

#include <iostream>
using namespace std;
main()
{
    setlocale (LC_ALL,"Rus");
    cout<<"Введите число: ";
    float x, y, z;
    cin>>x;
    cout<<"Введите число: ";
    cin>>y;
    cout<<"Введите число: ";
    cin>>z;
    if (x>0 or y>0 or z>0)
    {
        if (x>0) cout<<x<<" положительное число"<<endl;
        if (y>0) cout<<y<<" положительное число"<<endl;
        if (z>0) cout<<z<<" положительное число"<<endl;
    }
    else cout<<"Положительных чисел нет";
}
