//Дан символ. Определить, является ли знаком препинания.

#include <iostream>

using namespace std;

int main ()
{
setlocale (LC_ALL, "Russian");

cout<<"Введите символ, букву, число: ";
char c; //символ, который введёт пользователь
cin>> c;

bool y; //логическая переменная, которая будет присваивать true или false
y = ispunct(c); //isdigit проверит, является ли с цифрой, а y присвоит true или false в зависимости от введённого символа.


cout<<"Вы ввели цифру: "<< boolalpha<<(y)<<"\n\n"; //Выводится на экран "Вы ввели цифру: (true или false)".
}
