//Студент купил x тетрадей по цене p1 лей и у карандашей по цене р2 лей.
//Вывести на экран сколько денег потратил студент.

#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");

    int x,y,c,p1,p2; //x-тетради, y-карандаши, c-обшая стоимость тетрадей и карандашей, p1-стоимость одной тетради p2-стоимость одного карандаша

    cout<<"Сколько тетрадей купил студент (введите количество): ";
    cin>> x;
    cout<<"Сколько карандашей купил студент (введите количетсво): ";
    cin>> y;

    p1=11;
    p2=6;

    cout<<"\nСтоимость одной тетради: "<< p1 << " лей"<<endl;
    cout<<"Стоимость одного карандаша: "<< p2 << " лей"<< endl;

    x*=p1;//Стоимость всех купленных тетрадей
    y*=p2;//Стоиость всех купленных карандашей

    cout<<"\nСтудент потратил на тетради: "<< x<<" (лей/лея)"<< endl;
    cout<<"Студент потратил на карандаши: "<< y<<" (лей/лея)\n\n";

    c=y+x;//Обшая стоимость покупки (карандаши+тетради)

    cout<<"Студент оплатил: "<< c<<" (лей/лея)\n\n";

    cout<<"Ваша подсчёт окончен. Удачи!\n";

}
